{
  "homepage": "https://minecraft.curseforge.com/projects/the-twilight-forest",
  "1.12.2": {
    "3.3.202": "ADDED:\n • Block of Fiery Metal now deals damage when walked on.\n • Block of Arctic Fur reduces fall damage by 90%.\n • Block of Steeleaf reduces fall damage by 25%.\n • Advancement called \"Something Strange in The Towerwood\" was added.\n • Questing Ram has its own spawn egg now.\n • Questing Ram Trophy makes adorable noises now.\n • When a worn bug dies it now makes a *squish* sound.\n • The Anti-Builder now has a blacklist feature for people to prevent blocks being  destroyed, a must have for mods that add graves.\n • Added proper breaking particles to Device Translucent and the Castle Doors.\n • Added names to multiple unlocalised blocks.\n\nCHANGES:\n • Made axes not terrible damage wise.\n • Buffed the Giant Sword.\n • Added proper sounds and material to the new storage blocks.\n • Tri-Bow no longer creates free arrows, only one can be picked up again when shot.\n • New storage blocks can now be used as base blocks for a beacon.\n • Magic tree cores no longer drop with Silk Touch.\n • Final Castle doors are now in the creative menu and can be pick-blocked.\n • Some advancement names and descriptions had changes.\n\nFIXES:\n • Fixed the Magic Map grinding your FPS to a halt over time, thousands of duplicate icons were hogging up all the precious memory over time.\n • The new storage blocks now show up in the creative menu.\n • Fixed the shadows of several mobs, no longer does the Alpha Yeti feel like a Beta Yeti.\n • Knightly Axe now properly deals extra damage to unarmoured targets.\n • Temporary workaround to not display the dismount message when a Pinch Beetle grabs you.\n • Fixed Magic Beans not getting consumed upon use.\n • Hydra can now rotate its body again.\n • Hydra will no longer harm itself, it enjoys life once again.\n • Unstable Ice Cores will no longer be griefing jerks with the MobGriefing gamerule being false.\n    • The Hydra's mortar attack now also respects MobGriefing.\n • All mobs with a breath like attacks now have it functioning properly again.\n    • Also fixed the particle rendering of the Snow Queen's icy breath.\n • Charm of Keeping should now activate before a gravestone mod can take hold of your items.\n • Fixed a transparency issue when wearing the Quest Ram Trophy.\n • The mushroom growing on the Minoshroom's head is back where it belongs.\n • Roots are no longer offset by one pixel down.\n • Swarm Spiders and Carminite Broodlings are no longer intimate with ceilings to the point of death.",
    "3.4.239": "ADDED:\n • We now have loading screens when going to the Twilight Forest! \n • The Naga and Lich now have fancy incremental boss bars for the body segments and phases respectively.\n • The Block of Fiery Metal now has a fancy model.\n • Arctic armour now has lore text that makes it clear it can be dyed.\n     • Also added a advancement related to dying Arctic armour.\n • Armour made from boss drops now have damage resistance, balanced relative to the progression.\n • Death Tome has a chance to drop enchanted books.\n\nCHANGED:\n • Quest Ram now pulls rewards from a loot table.\n • Uncrafting Table now returns materials directly to inventory like 1.12 vanilla Crafting Table.\n • Changing dimension ID of the TF now requires a relaunch.\n • Changing seed of your world now needs the world reloaded.\n • The 'shedding' from Death Tomes now draws from a loot table.\n • Block of Fiery Metal now stays lit when set on fire.\n • Made the boss spawner unbreakable, no more pacifist route unless on peaceful.\n • The Ore Magnet no longer moves ores if it is a tile entity.\n •  Ghast Trap advancement is more specific in its wording.\n • Updated our JEI dependency to a newer version.\n\nFIXES:\n • Fixed Ironwood model.\n • Set particle Firefly size to 0 so they don't keep blinking in and out in F3+B mode.\n • Fixed a bug where all storage blocks worked as fuel.\n • Fixed Block of Fiery Metal and Block of Ironwood having parts render solid black without CTM.\n • Spruce trees in the snow biomes are no longer partially oak logs.\n • Giant blocks no longer destroy other blocks upon placement, including bedrock and the laws of physics.\n • Charm of Keeping and Charm of Life no longer conflict resulting in item loss, they now properly take turns and play nice.\n • Fiery Tears and Blood now show as interchangeable in JEI.\n • Roots no longer replace important blocks in generation.\n • Cleaned up the chunk generator some more.",
  },
  "promos": {
    "1.12.2-latest": "3.4.239",
    "1.12.2-recommended": "3.4.239"
  }
}