{
  "homepage": "https://minecraft.curseforge.com/projects/the-twilight-forest",
  "1.12.2": {
    "3.8.654": "FIXES:\n • Hotfix: Fixed a crash that happened on dedicated servers due to the new IE shaders.",
    "3.8.652": "ADDED:\n • Added a Quadraxis to the team, A great addition to the mod.\n • Added Auroralized Glass.\n • Added actual Castle Brick Stairs, literally the sequel to Jesus.\n • Cicadas can now be shot from an Immersive Engineering Railgun. You monster.\n • Added the Skylight Forest.\n      • Skylight Forest is a skyblock variant of Twilight Forest with only structures generating on their own little islands and everything else as void.\n • Parrots can now mimic any and all mobs in the mod. :parrot_party:\n • Added the Scepter of Fortification\n      • A new scepter dropped by the Lich that summons five (5) shields around you that each block a hit.\n      • Progression advancements each grant three (3) shields that don't decay over time.\n • The Naga Can now be dazed if it rams a blocking shield with its charge attack, knocking you both backwards in the process.\n • Giant Tools now have a longer reach.\n • The uncrafting Table is now compatible with shapeless recipes. It totally didn't become twice as broken in potential!\n      • It can now also cycle through multiple recipes in case of conflict.\n • Added tool shaders for Immersive Engineering with their own rarity, these include:\nTwilight, Firefly, Pinch Beetle, Snakestone, Mazestone, Underbrick, Towerwood, Carminite, Auroralized, Ironwood, Steeleaf, Knightly, Fiery, Final Castle, Cube of Annihilation, Questing Ram, Naga, Lich, Minoshroom, Hydra, Knight Phantom, Ur-Ghast, Alpha Yeti, Snow Queen.\n \nCHANGED:\n • Reworked the Druid Huts completely.\n      • Druid Huts are no longer the number one fire hazard in the forest. \n • /tffeature now can locate structures and can use tab-completion for so.\n • Phantom Armor when worn is now kept on death.\n      • It also cannot be enchanted with Curse of Binding and Curse of Vanishing anymore.\n • Improved handling of items displaced by a Charm of Keeping, should be more reliable now.\n • Tweaked Axe damage and speed values to better match vanilla.\n • Blacklisted surface lakes from some of the biomes.\n • Mobs like Deer, Boars, etc. are now unable to spawn on the Glacier.\n • The Minoshroom's charge attack now breaks through blocks.\n • Spiral Bricks are now in the creative menu.\n • Maze ceilings now always generated if there is no terrain.\n • Strongholds are now marked as clear on the last Knight's death.\n • Tweaked the Synergy tool trait.\n • There can now be multiple portal activations items specified in the config.\n • Twilight Saplings can now be used as Furnace fuel.\n • The Encased Firejet and Smoker now count as a wood material instead of stone.\n • Arctic Fur Blocks now break faster with shears.\n • Fiddleheads now require Shears to harvest.\n • The Lich's shields are now proper 3D models instead of two textures loosely glued together.\n • TF now registers its TEs under our own namespace, not the default. We have a datafixer that handles the transition, but once updated to this version the datafix is irreversible.\n \nFIXED:\n • Players can no longer spawn on top of the portal which would teleport them back into the overworld right away. Good lord that was annoying.\n      • Improved a lot of the logic relating to the Twilight Forest portal.\n • Fixed an issue with Trophy Pedestal progression where it didn't unlock after the Lich.\n • Remeasured the sizes of goblin's feet. Their boots should render on and fit them again.\n • The Seeker Bow now actually, you know, seeks again.\n • Fixed crash related to getting localized names of saplings on servers.\n • Removed a redundant language key in the Forgotten Explorer book for Yeti Caves.\n • Fixed Minotaurs dropping Magic Map foci instead of Maze Map.\n • Fiery tool heads now correctly have the missing Twilit and Flammable traits.\n • Changed the grip on the Moonworm Queen to be more comfortable, now correctly holding it as a tool in third person view.\n • Fixed a portal generation issue where it would generate underwater.\n • Added a null-check to tile entity access, fixing a crash with Mystcraft.\n • Cleaned up Bauble handling code, fixing console spam.\n • Fixed the blockstate rotations for Castle Brick Stair variants.\n • Fixed the lighting on some of the stair blocks.\n • Fixed incorrect level cost being shown for some recrafting recipes.\n • Giant blocks now correctly tile their texture.\n • Fixed a lighting issue on Fiery Blocks.\n • Portals are now prevented from generating inside of structures.\n • Refactored Naga Courtyard code, hopefully fixes generation issues.\n • Alternate Naga Courtyard Terrace pieces now generate again. #BlameDrullkus\n • Fixed a crash with the Uncrafting Table by adding some more checks.\n • The Fiery Pickaxe now correctly smelts every item a block drops if it drops multiple.\n • Fixed a Repeater in the Dark Tower not repeating what should be repeated, with delay.\n • Giant Leaves are now correctly tinted in inventories.\n • Fixed Uberous Soil not generating at the correct height.\n • Fixed the Snow Queen marking the wrong structure conquered on death.\n • Fixed the Charm of Keeping effects.\n • Setting the game to peaceful now correctly has the Snow waifu Queen put her spawner back.\n • Snow Queen minions now correctly spawn inside of the boss room during the fight.\n • Giant Tools are now held in a more human like fashion.\n • Firefly, Moonworm, and Cicada no longer use Soul Sand as their breaking particles.\n • Fixed the texture auto generator only processing first texture in array.\n • Lampposts can now generate again after several years. Neat.\n • Large mushrooms should no longer piggyback on top of each other.\n • Seeds even with only numbers were being used as seeds to make a random number seed instead of directing being used as a random number seed. Confusing, we know!",
    "3.7.424": "ADDED:\n • We split the progression into three separate lines, meaning that instead of clearing one dungeon and moving to the next in line, you now have the choice after defeating the Lich to go to the Hydra, Ur-Ghast, or Aurora Palace first.\nDefeating all three is still necessary to gain access to the Highlands.\n • Tinkers' Construct integration!\n      • Added Tinker's Construct Integration with Naga Scales, Steeleaves, Fiery Ingots, Knightmetal Ingots, and Raven's Feathers to make materials & tools out of.\n      • Added unique traits for each material:\n           • Twilit appears on all Twilight Forest materials, meaning your tool gains +2 speed in the Twilight Forest and deals +2 damage in any other dimension.\n           • Precipitate appears on Naga Scale materials, it lets you use the tool quicker with the lesser health on your Player.\n           • Synergy appears on Steeleaf materials, it will passively repair the tool if you have Steeleaf in your hotbar. The more Steeleaves you have in the hotbar, the faster it repairs.\n           • Stalwart appears on Knightmetal materials, it will make you more resilient in combat.\n           • Veiled appears on Raven's Feather materials, it will render arrows invisible.\n • Baubles integration!\n      • All charms can now be used in the off-hand and also equipped in the Baubles inventory.\n      • All tiers of the Charm of Keeping will keep the Baubles Inventory.\n • Thaumcraft Compat: Live & Reloaded! All items and blocks (aside from unobtainable and some WIP items) now have aspects.\n • Added a config option to make the Portal creation lightning not cause fires, disable it if you're against pyromania derrived fun.\n • Made a new potion effect for the ice render effect from Ice Bombs, Ice Bow, etc. instead of putting it on the Slowness effect.\n      • This also stops ice getting applied getting the slowness effect under certain conditions.\n • The Block and Chain now disables shields like an axe.\n • Added config option for players spawning for the first time to spawn in the Twilight Forest. Off by default.\n • Added config option to make Twilight Portals create a blocked-off portal at their destination. Toss in the activation item to unblock the portal. Off by default.\n • Added recipes where Iron armor and tools can be crafted directly into their Fiery counterparts.\n • Added Shield-Parrying for all Twilight Forest Projectiles. Installing https://minecraft.curseforge.com/projects/parry Shield Parry mod causes Twilight Forest to skip its parrying methods.\n • Updated the Japanese language file.\n • Updated the Chinese language file.\n • The Russian language file now covers everything in the mod.\nCHANGED:\n • Changed the Creative menu icon to the Miniature Portal item.\n • The advancements Past the Thorns and So Castle Very Wow now have a [NYI] tag in their names to signify they are not functional yet.\n • All tiers of the Charm of Keeping now preserve items in the off-hand slot.\n • Charm of Keeping usage now drops any items that would be overwritten by an item saved to prevent item loss if something is put in the player's inventory.\n • Code Improvements for Naga Courtyard.\nFIXED:\n • Magic Maps now properly update after switching Dimensions\n • The Zombie Scepter no longer joins its zombie kind by destroying itself at 0 durability.\n • Special leaves in Twilight Forest are now using the ore dictionary properly. (This totally wasn’t solved previously and went undocumented we swear.)\n • Ore magnet no longer checks ModID in the registry string.\n • Mazestone and its variants once again consume 16 durability from your mining tools when mined.\n • Castle Doors no longer have their texture broken.\n • Charm of Life effect upon death now uses the correct sprite.\n • Improved algorithm for the Miner's Tree, it should be less confused and stuck when trying to pull ores from the ground.\n • Fixed some blocks missing getBlockFaceShape overrides, causing glass panes, fences, walls, etc. to connect to blocks when they shouldn't.\n • Fixed the placement problems with Spiral Bricks and took off the [WIP] tag.\n • Finally fixed texture and UV problems with Knightly Armor and Phantom Armor; rejoice!\n • Ur-Ghast's tears should be visible again in Multiplayer when it's throwing a tantrum.",
    "3.6.345": "FIXES:\n • Hotfix: Fixed players getting kicked from servers when near locked structures.",
    "3.6.343": "FIXES:\n • Hotfix: Fixed Sponge server crashing related to packet fix last release.",
    "3.6.342": "ADDED:\n • Not yet fully implemented Tinkers' Construct compatibility for some of our materials to make tools out of.\n\nFIXES:\n • Fixed our Forge minimum version dependency string being behind.\n • Fixed potential console spam related to weather rendering when the mod 'Fancy Block Particles' is present.\n • Added a message that if Sponge is installed the max bounding-box-size should be adjusted for Hydras to show up properly.\n • Removed the structure layout print debug that appears in the console, made it into the release on accident.\n • Fixed a config-related crash.\n • Fixed a generation problem with terraces being mashed together despite us telling them not do.",
    "3.6.324": "ADDED:\n • The Naga Courtyard has received a complete revamp while maintaining the old style of it.\n      • More things are planned at a later date for a second batch.\n • Many new blocks styled for and after the Naga including but not limited to:\n      • Etched Nagastone\n           • Block is available in 6 rotations. It's a block that kind of is placed like a pillar except the swirls on the block are placed dependent on the direction you placed.\n           • Has 2x2 stone tiles on the end.\n           • Comes in normal, mossy, and cracked variants.\n      • Nagastone Pillar\n           • Block is available in 3 axal rotations.\n           • Works like vanilla Quartz Pillar Block.\n           • Comes in normal, mossy, and cracked variants.\n      • Nagastone Stairs\n           • Textures like Etched Nagastone.\n           • Has Left and Right facing variants dictating which way the swirls go.\n           • Both Left and Right come in normal, mossy, and cracked variants.\n      • Spiral Stone Bricks\n           • Can be used in a 2x2 patterns to make a complete spiral.\n           • The block itself is in 3D and has depth not only through shading.\n • The Uncrafting Table was added to the list of Crafting Tables for the Crafting Category in JEI.\n • Two original music tracks by MrOwltkins were added.\n • Updated our Chinese language file thanks to 3TUSK.\nCHANGED:\n • Block And Chain now appears from your left hand if used in the off-hand slot.\n      • Also cleaned up the code around there.\n • shifted the Knightmetal Loop texture to the middle.\n • Block and Chain + Cube of Annihilation leave their x16 boundary to accommodate their texture.\n • Made the Block and Chain thicker when held.\n • The Block and Chain recieved a model override, the texture will change to only the loop when it is thrown.\n      • Cube of Annihilation recieved a new texture for this too.\n • Optimized Cicadas, Fireflies, and Moonworms for the server side.\n      • Made TF Critters not tick at all on the server side.\n • Wispy Clouds are now dropped when broken.\n • Removed unused EntityTFTinyFirefly (old version of ParticleFirefly).\n • Made Castle Doors breakable again so people can use them until the Final Castle is implemented fully, afterwards we'll prevent them from breaking until the structure is cleared.\n • Broke the fourth wall, wont fix.\nFIXES:\n • Made the player invulnerable when teleporting across dimensions, this was the issue causing players to wrongly teleport.\n      • Fixed the issue when going through a portal would displace you up in the air.\n • Moved the language key for \"Underbrick Floor\" from meta 2 to meta 3 to fix lang entry collision for Underbrick.\n • Fixed a crash that happened due to the mod OpenTerrainGenerator.\n • Magic Beans once again properly grow into beanstalks on dedicated servers.\n • The vignette that appears in low light no longer randomly flickers in the Twilight Forest.\n • Fixed Root Strands being offset downwards for the second time, hopefully preventing them to sag with age.\n • Placing a giant block where it would replace a snow layer no longer crashes the client.\n • Moonworm Queen no longer breaks like a tool when it hits 0 durability.\n      • Only the Moonworm Queen you're using should wiggle now instead of all of them when you have multiple.\n • Scepter of Twilight/Life Draining once again can be recharged.\n • Fixed the broken fourth wall.",
    "3.5.263": "ADDED:\n • Added compatibility for many of our blocks with Chisel.\n • Crafting recipes added for Final Castle related blocks.\n      • Vanilla's block to stairs ratio in crafting makes no sense, we opted for the stair recipes to give you 8 instead of the usual 4.\n\nCHANGED:\n • \"And Drullkus said; \"let portals be shapeless!\" And it was so.\"\n      • Portals can now be made into any horizontal shape.\n      • They still have the same requirements (water pool, plants surrounding it, etc.)\n\nFIXES:\n • Fixed a serious crash involving the Anti-Builder.\n • Fixed an issue with the Trophies interacting with other mods such as Skillable.\n      • Also caught an Item Stack null.\n • All magic tree log variants now drop their respective wood properly.\n • Made sure bosses are recognised as such by the game.\n • Collected all of the Fireflies that escaped the Firefly Jar and put them back in.\n      • The Firefly \"block\" also gives off its little firefly lights again.\n • Resolved some Hydra rotation issues; it should no longer track you by spinning around at the speed of sound.",
    "3.4.239": "ADDED:\n • We now have loading screens when going to the Twilight Forest! \n • The Naga and Lich now have fancy incremental boss bars for the body segments and phases respectively.\n • The Block of Fiery Metal now has a fancy model.\n • Arctic armour now has lore text that makes it clear it can be dyed.\n     • Also added a advancement related to dying Arctic armour.\n • Armour made from boss drops now have damage resistance, balanced relative to the progression.\n • Death Tome has a chance to drop enchanted books.\n\nCHANGED:\n • Quest Ram now pulls rewards from a loot table.\n • Uncrafting Table now returns materials directly to inventory like 1.12 vanilla Crafting Table.\n • Changing dimension ID of the TF now requires a relaunch.\n • Changing seed of your world now needs the world reloaded.\n • The 'shedding' from Death Tomes now draws from a loot table.\n • Block of Fiery Metal now stays lit when set on fire.\n • Made the boss spawner unbreakable, no more pacifist route unless on peaceful.\n • The Ore Magnet no longer moves ores if it is a tile entity.\n •  Ghast Trap advancement is more specific in its wording.\n • Updated our JEI dependency to a newer version.\n\nFIXES:\n • Fixed Ironwood model.\n • Set particle Firefly size to 0 so they don't keep blinking in and out in F3+B mode.\n • Fixed a bug where all storage blocks worked as fuel.\n • Fixed Block of Fiery Metal and Block of Ironwood having parts render solid black without CTM.\n • Spruce trees in the snow biomes are no longer partially oak logs.\n • Giant blocks no longer destroy other blocks upon placement, including bedrock and the laws of physics.\n • Charm of Keeping and Charm of Life no longer conflict resulting in item loss, they now properly take turns and play nice.\n • Fiery Tears and Blood now show as interchangeable in JEI.\n • Roots no longer replace important blocks in generation.\n • Cleaned up the chunk generator some more.",
    "3.3.202": "ADDED:\n • Block of Fiery Metal now deals damage when walked on.\n • Block of Arctic Fur reduces fall damage by 90%.\n • Block of Steeleaf reduces fall damage by 25%.\n • Advancement called \"Something Strange in The Towerwood\" was added.\n • Questing Ram has its own spawn egg now.\n • Questing Ram Trophy makes adorable noises now.\n • When a worn bug dies it now makes a *squish* sound.\n • The Anti-Builder now has a blacklist feature for people to prevent blocks being  destroyed, a must have for mods that add graves.\n • Added proper breaking particles to Device Translucent and the Castle Doors.\n • Added names to multiple unlocalised blocks.\n\nCHANGES:\n • Made axes not terrible damage wise.\n • Buffed the Giant Sword.\n • Added proper sounds and material to the new storage blocks.\n • Tri-Bow no longer creates free arrows, only one can be picked up again when shot.\n • New storage blocks can now be used as base blocks for a beacon.\n • Magic tree cores no longer drop with Silk Touch.\n • Final Castle doors are now in the creative menu and can be pick-blocked.\n • Some advancement names and descriptions had changes.\n\nFIXES:\n • Fixed the Magic Map grinding your FPS to a halt over time, thousands of duplicate icons were hogging up all the precious memory over time.\n • The new storage blocks now show up in the creative menu.\n • Fixed the shadows of several mobs, no longer does the Alpha Yeti feel like a Beta Yeti.\n • Knightly Axe now properly deals extra damage to unarmoured targets.\n • Temporary workaround to not display the dismount message when a Pinch Beetle grabs you.\n • Fixed Magic Beans not getting consumed upon use.\n • Hydra can now rotate its body again.\n • Hydra will no longer harm itself, it enjoys life once again.\n • Unstable Ice Cores will no longer be griefing jerks with the MobGriefing gamerule being false.\n    • The Hydra's mortar attack now also respects MobGriefing.\n • All mobs with a breath like attacks now have it functioning properly again.\n    • Also fixed the particle rendering of the Snow Queen's icy breath.\n • Charm of Keeping should now activate before a gravestone mod can take hold of your items.\n • Fixed a transparency issue when wearing the Quest Ram Trophy.\n • The mushroom growing on the Minoshroom's head is back where it belongs.\n • Roots are no longer offset by one pixel down.\n • Swarm Spiders and Carminite Broodlings are no longer intimate with ceilings to the point of death."
  },
  "promos": {
    "1.12.2-latest": "3.8.654",
    "1.12.2-recommended": "3.8.654",
    "1.7.10-latest": "2.3.7",
    "1.7.10-recommended": "2.3.7"
  }
}